In [1]:
import pandas as pd
import numpy as np

In [4]:
my_data=np.array([[10,20,30],[20,30,40],[20,50,10],[10,15,20]])

In [5]:
my_data

array([[10, 20, 30],
       [20, 30, 40],
       [20, 50, 10],
       [10, 15, 20]])

In [12]:
my_names=["James","Lars","Kirk","Rob"]

In [13]:
my_columns=["Jan","Feb","Mar"]

In [14]:
my_data_frame=pd.DataFrame(my_data)

In [15]:
my_data_frame

    0   1   2
0  10  20  30
1  20  30  40
2  20  50  10
3  10  15  20

In [16]:
new_data_frame=pd.DataFrame(my_data,index=my_names,columns=my_columns)

In [17]:
new_data_frame

       Jan  Feb  Mar
James   10   20   30
Lars    20   30   40
Kirk    20   50   10
Rob     10   15   20

In [18]:
new_data_frame["Feb"]

James    20
Lars     30
Kirk     50
Rob      15
Name: Feb, dtype: int32

In [21]:
feb_series=new_data_frame["Feb"]

In [22]:
feb_series.mean()

28.75

In [23]:
feb_series.Lars

30

In [25]:
feb_series.max()

50

In [28]:
new_data_frame[["Jan","Feb"]]

       Jan  Feb
James   10   20
Lars    20   30
Kirk    20   50
Rob     10   15

In [29]:
new_data_frame.loc["Lars"]

Jan    20
Feb    30
Mar    40
Name: Lars, dtype: int32

In [31]:
new_data_frame.loc["Rob"].mean()

15.0

In [32]:
new_data_frame

       Jan  Feb  Mar
James   10   20   30
Lars    20   30   40
Kirk    20   50   10
Rob     10   15   20

In [33]:
new_data_frame.loc["James"].max()

30

In [34]:
new_data_frame.loc["Kirk"].mean()

26.666666666666668

In [37]:
new_data_frame.iloc[0]

Jan    10
Feb    20
Mar    30
Name: James, dtype: int32

In [47]:
new_data_frame["April"]=new_data_frame["Mar"]*2

In [49]:
new_data_frame

       Jan  Feb  Mar  April
James   10   20   30     60
Lars    20   30   40     80
Kirk    20   50   10     20
Rob     10   15   20     40

In [50]:
new_data_frame.drop("Rob",axis=0)

       Jan  Feb  Mar  April
James   10   20   30     60
Lars    20   30   40     80
Kirk    20   50   10     20

In [51]:
new_data_frame.drop("Feb",axis=1)

       Jan  Mar  April
James   10   30     60
Lars    20   40     80
Kirk    20   10     20
Rob     10   20     40

In [52]:
new_data_frame

       Jan  Feb  Mar  April
James   10   20   30     60
Lars    20   30   40     80
Kirk    20   50   10     20
Rob     10   15   20     40

In [53]:
new_data_frame.drop("April",axis=1,inplace=True)

In [54]:
new_data_frame

       Jan  Feb  Mar
James   10   20   30
Lars    20   30   40
Kirk    20   50   10
Rob     10   15   20

In [55]:
boolean_frame=new_data_frame>25

In [56]:
boolean_frame

         Jan    Feb    Mar
James  False  False   True
Lars   False   True   True
Kirk   False   True  False
Rob    False  False  False

In [59]:
new_data_frame[boolean_frame]

       Jan   Feb   Mar
James  NaN   NaN  30.0
Lars   NaN  30.0  40.0
Kirk   NaN  50.0   NaN
Rob    NaN   NaN   NaN

In [60]:
new_data_frame[new_data_frame>30]

       Jan   Feb   Mar
James  NaN   NaN   NaN
Lars   NaN   NaN  40.0
Kirk   NaN  50.0   NaN
Rob    NaN   NaN   NaN

In [61]:
new_data_frame

       Jan  Feb  Mar
James   10   20   30
Lars    20   30   40
Kirk    20   50   10
Rob     10   15   20

In [62]:
new_data_frame["Yeni Kolon"]=["Ege","Demet","Buket","Özlem"]

In [63]:
new_data_frame

       Jan  Feb  Mar Yeni Kolon
James   10   20   30        Ege
Lars    20   30   40      Demet
Kirk    20   50   10      Buket
Rob     10   15   20      Özlem

In [65]:
new_data_frame["Özel"]=["Vans","Coloumbia","Converse","Puma"]